{
    "data": 
    [
        {
            "id" :  "{8662FE1B-7D39-4846-AE4B-62621E9941E2}",
            "name": "Bee Orchid",
            "image": "http://galasoft.ch/labs/flowers/images/BeeOrchid.jpg",
            "description": "Ophrys apifera grows to a height of 15-50 centimetres (6-20 in). This hardy orchid develops small rosettes of leaves in autumn. They continue to grow slowly during winter. Basal leaves are ovate or oblong-lanceolate, upper leaves and bracts are ovate-lanceolate and sheathing. The plant blooms from mid-April to July producing a spike composed from one to twelve flowers. The flowers have large sepals, with a central green rib and their colour varies from white to pink, while petals are short, pubescent, yellow to greenish. The labellum is trilobed, with two pronounced humps on the hairy lateral lobes, the median lobe is hairy and similar to the abdomen of a bee. It is quite variable in the pattern of coloration, but usually brownish-red with yellow markings. The gynostegium is at right angles, with an elongated apex.",
            "comments": [
                {
                    "id": "{8B683418-B6AB-4070-8295-A86B89D5C8B7}",
                    "inputdate": "2014-09-21T18:13:42Z",
                    "text": "Thinking about adding this to my garden next year!"
                }
            ]
        },
        {
            "id" :  "{6CCBF7D6-4DC8-46DA-9431-D3FD20ABD24C}",
            "name": "Bermuda Buttercup",
            "image": "http://galasoft.ch/labs/flowers/images/BermudaButtercup.jpg",
            "description": "The Oxalis pes-caprae flower is actinomorphic, with a calyx composed of five free or slightly fused sepals, a sympetalous corolla composed of five fused petals, an apoandrous androecium composed of ten free stamens in two ranks, and a compound pistil. Like most African Oxalis species, it produces adventitious subterranean propagules. These take the form of true bulbs in botanical terms, which is unusual among dicotyledons. In fact, Oxalis pes-caprae produces small bulbs copiously, whereas most other African species produce fewer, larger bulbs. New world Oxalis, such as Oxalis corniculata, apparently do not generally produce bulbs."
        },
        {
            "id" :  "{BFF6481D-9121-4007-BE7E-3CBC8B214B3D}",
            "name": "Bind Weed",
            "image": "http://galasoft.ch/labs/flowers/images/BindWeed.jpg",
            "description": "Calystegia (bindweed, false bindweed, or morning glory) is a genus of about 25 species of flowering plants in the bindweed family Convolvulaceae. The genus has a cosmopolitan distribution in temperate and subtropical regions, but with half of the species endemic to California. They are annual or herbaceous perennial twining vines growing to 1-5 m tall, with spirally arranged leaves. The flowers are trumpet-shaped, 3-10 cm diameter, white or pink, with a sometimes inflated basal calyx."
        },
        {
            "id" :  "{5ED54D72-88CC-4B51-A690-D9695A464533}",
            "name": "Blue Gem",
            "image": "http://galasoft.ch/labs/flowers/images/BlueGem.jpg",
            "description": "Blue Gem has masses of amazing vivid blue/purple flowers that look almost fluorescent! It flowers profusely in spring and regularly at other times of the year."
        },
        {
            "id" :  "{B19167FE-002C-460E-AE5F-83C317814F03}",
            "name": "Calla Lily",
            "image": "http://galasoft.ch/labs/flowers/images/CallaLily.jpg",
            "description": "Calla (Bog Arum, Marsh Calla, Wild Calla, and Water-arum) is a genus of flowering plant in the family Araceae, containing the single species Calla palustris. It is native to cool temperate regions of the Northern Hemisphere, in central, eastern and northern Europe (France and Norway eastward), northern Asia and northern North America (Alaska, Canada, and northeastern contiguous United States)."
        },
        {
            "id" :  "{D9E66571-A2AE-4F85-9C4F-4BEAC2AAFF32}",
            "name": "Common Mallow",
            "image": "http://galasoft.ch/labs/flowers/images/CommonMallow.jpg",
            "description": "Malva sylvestris is a species of the mallow genus Malva in the family of Malvaceae and is considered to be the type species for the genus. Known as common mallow to English speaking Europeans, it acquired the common names of cheeses, high mallow and tall mallow (mauve des bois by the French) as it migrated from its native home in Western Europe, North Africa and Asia through the English speaking world. M. sylvestris is a vigorously healthy plant with showy flowers of bright mauve-purple, with dark veins; a handsome plant, often standing 3 or 4 feet (1 m) high and growing freely in fields, hedgerows and in fallow fields."
        },
        {
            "id" :  "{AF79A147-26E6-4F76-83E9-F6383A7E5F2C}",
            "name": "Crateva Religiosa",
            "image": "http://galasoft.ch/labs/flowers/images/CratevaReligiosa.jpg",
            "description": "The flowering tree Crateva religiosa (syn Crataeva religiosa, Crateva adansonii) is called the sacred garlic pear and temple plant, and many other names in a variety of dialects, including Balai Lamok, abiyuch, barna, varuna, and bidasi. The tree is sometimes called the spider tree because the showy flowers bear long, spidery stamens. It is native to Japan, Australia, much of Southeast Asia and several South Pacific islands. It is grown elsewhere for fruit, especially in parts of the African continent."
        },
        {
            "id" :  "{9FEF4DE5-7BD4-4F9E-98C4-C79C5CCB60FA}",
            "name": "Lantana",
            "image": "http://galasoft.ch/labs/flowers/images/Lantana.jpg",
            "description": "Lantana is a genus of about 150 species of perennial flowering plants in the verbena family, Verbenaceae. They are native to tropical regions of the Americas and Africa but exist as an introduced species in numerous areas, especially in the Australian-Pacific region. The genus includes both herbaceous plants and shrubs growing to 0.5–2 m (1.6–6.6 ft) tall. Their common names are shrub verbenas or lantanas. The generic name originated in Late Latin, where it refers to the unrelated Viburnum lantana."
        },
        {
            "id" :  "{303BB759-BE8A-4091-BBFE-81ABFA9B32BB}",
            "name": "Oleander",
            "image": "http://galasoft.ch/labs/flowers/images/Oleander.jpg",
            "description": "Nerium oleander is an evergreen shrub or small tree in the dogbane family Apocynaceae, toxic in all its parts. It is the only species currently classified in the genus Nerium. It is most commonly known as oleander, from its superficial resemblance to the unrelated olive Olea. It is so widely cultivated that no precise region of origin has been identified, though southwest Asia has been suggested. The ancient city of Volubilis in Morocco may have taken its name from the Berber name oualilt for the flower. Oleander is one of the most poisonous of commonly grown garden plants."
        },
        {
            "id" :  "{CAA54B44-A246-44DD-83E8-81E757883E13}",
            "name": "Orange Cosmos",
            "image": "http://galasoft.ch/labs/flowers/images/OrangeCosmos.jpg",
            "description": "Cosmos is native to scrub and meadowland in Mexico where most of the species occur, Florida and the southern United States, Arizona, Central America, and to South America in the north to Paraguay in the south. It is also widespread over the high eastern plains of South Africa, where it was introduced via contaminated horsefeed imported from Argentina during the Anglo-Boer War."
        },
        {
            "id" :  "{DDB8F85C-DC36-4F40-97B0-63AF859D88E0}",
            "name": "Poppy",
            "image": "http://galasoft.ch/labs/flowers/images/Poppy.jpg",
            "description": "A poppy is a flowering plant in the subfamily Papaveroideae of the family Papaveraceae. Poppies are herbaceous plants, often grown for their colourful flowers. One species of poppy, Papaver somniferum produces edible seeds, and is also the source of the crude drug opium which contains powerful medicinal alkaloids such as morphine and has been used since ancient times as an analgesic and narcotic medicinal and recreational drugs. Following the trench warfare which took place in the poppy fields of Flanders, during the 1st World War, red poppies have become a symbol of remembrance of soldiers who have died during wartime."
        },
        {
            "id" :  "{1D9EEE20-05A3-4C31-9DB2-BFFA227DD99B}",
            "name": "Primula Farinosa",
            "image": "http://galasoft.ch/labs/flowers/images/PrimulaFarinosa.jpg",
            "description": "Primula farinosa, the bird's-eye primrose, is a small perennial plant in the family Primulaceae, native to Northern Europe and northern Asia, and (rarely) farther south at high altitudes in the mountains of southern Europe. This primrose thrives on grazed meadows rich in lime and moisture."
        },
        {
            "id" :  "{B98D2D97-CFB3-4516-8A7D-74951A71A5B9}",
            "name": "Scarlet Pimpernel",
            "image": "http://galasoft.ch/labs/flowers/images/ScarletPimpernel.jpg",
            "description": "Anagallis is a genus of about 20–25 species of flowering plants in the family Myrsinaceae, commonly called pimpernel and perhaps best known for the scarlet pimpernel referred to in literature. The botanical name is from the Greek, ana, \"again\", and agallein, \"to delight in\", and refers to the opening and closing of the flowers in response to environmental conditions."
        },
        {
            "id" :  "{3EC983FF-7D4C-435F-8584-6FA720CD1345}",
            "name": "Spanish Oyster",
            "image": "http://galasoft.ch/labs/flowers/images/SpanishOyster.jpg",
            "description": "Scolymus hispanicus (common golden thistle or Spanish oyster thistle) is a flowering plant in the genus Scolymus in the family Asteraceae, native to southern and western Europe, north to northwestern France. It is a herbaceous biennial or short-lived perennial plant growing to 80 cm tall, with spiny stems and leaves. The flowerheads are bright yellow to orange-yellow, 2-3 cm diameter"
        },
        {
            "id" :  "{DEE826F3-B406-4389-860C-7A70BDBE4612}",
            "name": "St Bernard Lily",
            "image": "http://galasoft.ch/labs/flowers/images/StBernardLily.jpg",
            "description": "Anthericum liliago (St Bernard's lily) is a species of the genus Anthericum in the family Asparagaceae. It is native to Europe and Turkey, growing in dry pastures, stony places and open woods and flowering in early summer."
        },
        {
            "id" :  "{EA33C097-9E51-4465-B7EA-F53A2528024D}",
            "name": "Stork's Bill",
            "image": "http://galasoft.ch/labs/flowers/images/StorksBill.jpg",
            "description": "Erodium cicutarium, also known as redstem filaree, common stork's-bill or pinweed, is a herbaceous annual – or in warm climates, biennial – member of the family Geraniaceae of flowering plants. It is native to the Mediterranean Basin and was introduced to North America in the eighteenth century, where it has since become invasive, particularly of the deserts and arid grasslands of the southwestern United States."
        },
        {
            "id" :  "{5A7BAB26-C648-40BD-999A-69EDBC9F4EDE}",
            "name": "Verbascum",
            "image": "http://galasoft.ch/labs/flowers/images/Verbascum.jpg",
            "description": "Verbascum, common name mullein (also known as velvet plant) is a genus of about 250 species of flowering plants in the figwort family Scrophulariaceae. They are native to Europe and Asia, with the highest species diversity in the Mediterranean. Mullein or \"Mullein leaf\" often refers to the leaves of Verbascum thapsus, the great or common mullein, which is frequently used in herbal medicine."
        }
    ]
}